### [상위 10%와 하위 90%의 생존율 비교]

In [38]:
# [1] 모듈로딩
import pandas as pd
import numpy as np

In [39]:
# [2] 엑셀 파일 불러오기 위해 설치
%pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\kdp-14\anaconda3\envs\samban\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\kdp-14\anaconda3\envs\samban\lib\site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [40]:
# [3] 데이터 준비
file_name = 'titanic.csv'

In [41]:
tDF=pd.read_csv(file_name)
tDF

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [42]:
# [4] 데이터 확인
print(f'데이터 행 개수 : {tDF.shape[0]}, 열 개수 : {tDF.shape[1]}')
print(f'데이터 컬럼 : {tDF.columns}')
print(f'데이터 인덱스 : {tDF.index}')
print(f'데이터 타입 : \n{tDF.dtypes}')

데이터 행 개수 : 891, 열 개수 : 15
데이터 컬럼 : Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')
데이터 인덱스 : RangeIndex(start=0, stop=891, step=1)
데이터 타입 :
survived         int64
pclass           int64
sex             object
age            float64
sibsp            int64
parch            int64
fare           float64
embarked        object
class           object
who             object
adult_male        bool
deck            object
embark_town     object
alive           object
alone             bool
dtype: object

In [43]:
# [5] 실제 데이터랑 비교
print(f'{tDF.head()},\n\n\n {tDF.tail()}')

# age를 사용할 시 NaN 값이 존재하는 것을 확인

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True  ,


      survived  pclass     sex   age  sibsp  parch   fare embarked   class  \
886         0       2    male  27.0      0      0  13.00        S  Second
887         1       1  female  19.0      0      0  30.00        S   First
888         0       3  female   NaN      1      2  23.45        S   Third
889         1       1    male  26.0      0      0  30.00        C   First
890         0       3    male  32.0      0      0   7.75        Q   Third

       who  adult_male deck  embark_town alive  alone
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

In [44]:
# [6] 결측치 check
tDF.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [45]:
# 결측치가 age와 embarked, deck ,embark_town 에서 나왔기 때문에 유의미한 데이터 분석을 위해 해당 열을 삭제
tDF1=tDF.dropna(axis=1)

In [46]:
# 데이터 분석에 필요없는 행 삭제
tDF1=tDF1.drop(['sex','sibsp','parch','who','adult_male','alive','alone','class'],axis=1)

In [47]:
tDF1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  891 non-null    int64
 1   pclass    891 non-null    int64
 2   fare      891 non-null    float64
dtypes: float64(1), int64(2)
memory usage: 21.0 KB

In [48]:
# fare의 describe 알아보기
tDF1.fare.describe()

# 타이타닉 호에는 돈을 내지 않고 탄 사람도 있다.
# 생각보다 평균과 상위 75%의 비율이 크게 다르지 않다.
# 표준 편차가 크다.

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: fare, dtype: float64

In [49]:
tDF1.fare.unique()

array([  7.25  ,  71.2833,   7.925 ,  53.1   ,   8.05  ,   8.4583,
        51.8625,  21.075 ,  11.1333,  30.0708,  16.7   ,  26.55  ,
        31.275 ,   7.8542,  16.    ,  29.125 ,  13.    ,  18.    ,
         7.225 ,  26.    ,   8.0292,  35.5   ,  31.3875, 263.    ,
         7.8792,   7.8958,  27.7208, 146.5208,   7.75  ,  10.5   ,
        82.1708,  52.    ,   7.2292,  11.2417,   9.475 ,  21.    ,
        41.5792,  15.5   ,  21.6792,  17.8   ,  39.6875,   7.8   ,
        76.7292,  61.9792,  27.75  ,  46.9   ,  80.    ,  83.475 ,
        27.9   ,  15.2458,   8.1583,   8.6625,  73.5   ,  14.4542,
        56.4958,   7.65  ,  29.    ,  12.475 ,   9.    ,   9.5   ,
         7.7875,  47.1   ,  15.85  ,  34.375 ,  61.175 ,  20.575 ,
        34.6542,  63.3583,  23.    ,  77.2875,   8.6542,   7.775 ,
        24.15  ,   9.825 ,  14.4583, 247.5208,   7.1417,  22.3583,
         6.975 ,   7.05  ,  14.5   ,  15.0458,  26.2833,   9.2167,
        79.2   ,   6.75  ,  11.5   ,  36.75  ,   7.7958,  12.525 ,
        66.6   ,   7.3125,  61.3792,   7.7333,  69.55  ,  16.1   ,
        15.75  ,  20.525 ,  55.    ,  25.925 ,  33.5   ,  30.6958,
        25.4667,  28.7125,   0.    ,  15.05  ,  39.    ,  22.025 ,
        50.    ,   8.4042,   6.4958,  10.4625,  18.7875,  31.    ,
       113.275 ,  27.    ,  76.2917,  90.    ,   9.35  ,  13.5   ,
         7.55  ,  26.25  ,  12.275 ,   7.125 ,  52.5542,  20.2125,
        86.5   , 512.3292,  79.65  , 153.4625, 135.6333,  19.5   ,
        29.7   ,  77.9583,  20.25  ,  78.85  ,  91.0792,  12.875 ,
         8.85  , 151.55  ,  30.5   ,  23.25  ,  12.35  , 110.8833,
       108.9   ,  24.    ,  56.9292,  83.1583, 262.375 ,  14.    ,
       164.8667, 134.5   ,   6.2375,  57.9792,  28.5   , 133.65  ,
        15.9   ,   9.225 ,  35.    ,  75.25  ,  69.3   ,  55.4417,
       211.5   ,   4.0125, 227.525 ,  15.7417,   7.7292,  12.    ,
       120.    ,  12.65  ,  18.75  ,   6.8583,  32.5   ,   7.875 ,
        14.4   ,  55.9   ,   8.1125,  81.8583,  19.2583,  19.9667,
        89.1042,  38.5   ,   7.725 ,  13.7917,   9.8375,   7.0458,
         7.5208,  12.2875,   9.5875,  49.5042,  78.2667,  15.1   ,
         7.6292,  22.525 ,  26.2875,  59.4   ,   7.4958,  34.0208,
        93.5   , 221.7792, 106.425 ,  49.5   ,  71.    ,  13.8625,
         7.8292,  39.6   ,  17.4   ,  51.4792,  26.3875,  30.    ,
        40.125 ,   8.7125,  15.    ,  33.    ,  42.4   ,  15.55  ,
        65.    ,  32.3208,   7.0542,   8.4333,  25.5875,   9.8417,
         8.1375,  10.1708, 211.3375,  57.    ,  13.4167,   7.7417,
         9.4833,   7.7375,   8.3625,  23.45  ,  25.9292,   8.6833,
         8.5167,   7.8875,  37.0042,   6.45  ,   6.95  ,   8.3   ,
         6.4375,  39.4   ,  14.1083,  13.8583,  50.4958,   5.    ,
         9.8458,  10.5167])

In [50]:
# 여유 있는 사람의 기준 상위 10%
tDF1.sort_values(by='fare',ascending=False).head(90)

     survived  pclass      fare
258         1       1  512.3292
737         1       1  512.3292
679         1       1  512.3292
88          1       1  263.0000
27          0       1  263.0000
..        ...     ...       ...
496         1       1   78.2667
591         1       1   78.2667
627         1       1   77.9583
275         1       1   77.9583
765         1       1   77.9583

[90 rows x 3 columns]

In [51]:
fare_index = (tDF1['fare'] >= 77.9583)
tDF2 = tDF1[fare_index]

In [52]:
tDF2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 90 entries, 27 to 879
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  90 non-null     int64
 1   pclass    90 non-null     int64
 2   fare      90 non-null     float64
dtypes: float64(1), int64(2)
memory usage: 2.8 KB

In [53]:
tDF2

     survived  pclass      fare
27          0       1  263.0000
31          1       1  146.5208
34          0       1   82.1708
61          1       1   80.0000
62          0       1   83.4750
..        ...     ...       ...
829         1       1   80.0000
835         1       1   83.1583
849         1       1   89.1042
856         1       1  164.8667
879         1       1   83.1583

[90 rows x 3 columns]

In [54]:
# 상위 10%의 사람들과 객실 등급의 관계
tDF2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 90 entries, 27 to 879
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  90 non-null     int64
 1   pclass    90 non-null     int64
 2   fare      90 non-null     float64
dtypes: float64(1), int64(2)
memory usage: 2.8 KB

In [55]:
tDF.corr(numeric_only=True)

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
survived,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307,-0.557080,-0.203367
pclass,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500,0.094035,0.135207
age,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067,0.280328,0.198270
sibsp,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651,-0.253586,-0.584471
parch,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225,-0.349943,-0.583398
fare,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000,-0.182024,-0.271832
adult_male,-0.557080,0.094035,0.280328,-0.253586,-0.349943,-0.182024,1.000000,0.404744
alone,-0.203367,0.135207,0.198270,-0.584471,-0.583398,-0.271832,0.404744,1.000000

In [75]:
tDF2['pclass']

27     1
31     1
34     1
61     1
62     1
      ..
829    1
835    1
849    1
856    1
879    1
Name: pclass, Length: 90, dtype: int64

In [76]:
tDF2.corr(numeric_only=True)

          survived  pclass      fare
survived  1.000000     NaN -0.001116
pclass         NaN     NaN       NaN
fare     -0.001116     NaN  1.000000

In [57]:
tDF2.pclass.unique()
# 상위 10%는 모두 1등석에 탔다.

array([1], dtype=int64)

In [58]:
# 그러면 10%의 사람들의 생존율 어떨까?
survived_index=tDF2['survived'] == 1
tDF3=tDF2[survived_index]
tDF3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 69 entries, 31 to 879
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  69 non-null     int64
 1   pclass    69 non-null     int64
 2   fare      69 non-null     float64
dtypes: float64(1), int64(2)
memory usage: 2.2 KB

In [59]:
# 상위 10% 사람들의 생존율
top_survived=tDF3.shape[0]/tDF2.shape[0]
top_survived

0.7666666666666667

In [60]:
# 하위 90%의 DataFrame 만들기
fare_index = (tDF1['fare'] < 77.9583)
tDF4=tDF1[fare_index]
tDF4

     survived  pclass     fare
0           0       3   7.2500
1           1       1  71.2833
2           1       3   7.9250
3           1       1  53.1000
4           0       3   8.0500
..        ...     ...      ...
886         0       2  13.0000
887         1       1  30.0000
888         0       3  23.4500
889         1       1  30.0000
890         0       3   7.7500

[801 rows x 3 columns]

In [61]:
# 상위 90%의 사람들과 객실 등급의 관계
tDF4.pclass.value_counts()

pclass
3    491
2    184
1    126
Name: count, dtype: int64

In [62]:
survived_index=tDF4['survived'] == 1
tDF5=tDF4[survived_index]
tDF5.info()

<class 'pandas.core.frame.DataFrame'>
Index: 273 entries, 1 to 889
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  273 non-null    int64
 1   pclass    273 non-null    int64
 2   fare      273 non-null    float64
dtypes: float64(1), int64(2)
memory usage: 8.5 KB

In [63]:
# 상위 90% 사람들의 생존율
low_survived=tDF5.shape[0]/tDF4.shape[0]
low_survived

0.3408239700374532

In [64]:
print(f'상위 10%의 생존율은 {round(top_survived,3)}이고 하위 90%의 생존율은 {round(low_survived,3)}입니다.')

상위 10%의 생존율은 0.767이고 하위 90%의 생존율은 0.341입니다.

### [class별 생존율 비교]

In [65]:
tDF1

     survived  pclass     fare
0           0       3   7.2500
1           1       1  71.2833
2           1       3   7.9250
3           1       1  53.1000
4           0       3   8.0500
..        ...     ...      ...
886         0       2  13.0000
887         1       1  30.0000
888         0       3  23.4500
889         1       1  30.0000
890         0       3   7.7500

[891 rows x 3 columns]

In [66]:
# 1등석 사람들 DataFrame
fst_index= (tDF1.pclass == 1)
fst_result=tDF1[fst_index]
fst_result.info()

<class 'pandas.core.frame.DataFrame'>
Index: 216 entries, 1 to 889
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  216 non-null    int64
 1   pclass    216 non-null    int64
 2   fare      216 non-null    float64
dtypes: float64(1), int64(2)
memory usage: 6.8 KB

In [67]:
# 1등석 사람들 중 살아남은 사람들 DataFrame
fst_sur_index= (tDF1.pclass == 1) & (tDF1.survived == 1)
fst_sur_result=tDF1[fst_sur_index]
fst_sur_result.info()

<class 'pandas.core.frame.DataFrame'>
Index: 136 entries, 1 to 889
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  136 non-null    int64
 1   pclass    136 non-null    int64
 2   fare      136 non-null    float64
dtypes: float64(1), int64(2)
memory usage: 4.2 KB

In [68]:
# 2등석 사람들 DataFrame
scd_index= (tDF1.pclass == 2)
scd_result=tDF1[scd_index]
scd_result.info()

<class 'pandas.core.frame.DataFrame'>
Index: 184 entries, 9 to 886
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  184 non-null    int64
 1   pclass    184 non-null    int64
 2   fare      184 non-null    float64
dtypes: float64(1), int64(2)
memory usage: 5.8 KB

In [69]:
# 2등석 사람들 중 살아남은 사람들 DataFrame
scd_sur_index= (tDF1.pclass == 2) & (tDF1.survived == 1)
scd_sur_result=tDF1[scd_sur_index]
scd_sur_result.info()

<class 'pandas.core.frame.DataFrame'>
Index: 87 entries, 9 to 880
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  87 non-null     int64
 1   pclass    87 non-null     int64
 2   fare      87 non-null     float64
dtypes: float64(1), int64(2)
memory usage: 2.7 KB

In [70]:
# 3등석 사람들 DataFrame
trd_index= (tDF1.pclass == 3)
trd_result=tDF1[trd_index]
trd_result.info()

<class 'pandas.core.frame.DataFrame'>
Index: 491 entries, 0 to 890
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  491 non-null    int64
 1   pclass    491 non-null    int64
 2   fare      491 non-null    float64
dtypes: float64(1), int64(2)
memory usage: 15.3 KB

In [71]:
# 3등석 사람들 중 살아남은 사람들 DataFrame
trd_sur_index= (tDF1.pclass == 3) & (tDF1.survived == 1)
trd_sur_result=tDF1[trd_sur_index]
trd_sur_result.info()

<class 'pandas.core.frame.DataFrame'>
Index: 119 entries, 2 to 875
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  119 non-null    int64
 1   pclass    119 non-null    int64
 2   fare      119 non-null    float64
dtypes: float64(1), int64(2)
memory usage: 3.7 KB

In [72]:
print(f'1등석의 생존율 :{fst_sur_result.shape[0]/fst_result.shape[0]}')

1등석의 생존율 :0.6296296296296297

In [73]:
print(f'2등석의 생존율 :{scd_sur_result.shape[0]/scd_result.shape[0]}')

2등석의 생존율 :0.47282608695652173

In [74]:
print(f'3등석의 생존율 :{trd_sur_result.shape[0]/trd_result.shape[0]}')

3등석의 생존율 :0.24236252545824846

## 자본과 생존율은 비례한다.